/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "Toimintoa ei voida suorittaa loppuun";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "Yritä myöhemmin uudelleen.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "Tätä mediamuotoa ei tueta.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "Media saattaa olla vahingoittunut.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "Ohjelma ei ole valtuutettu toistamaan tätä tiedostoa."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "Mediaa ei voida käyttää.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "Ei voida purkaa";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "Tälle medialle tarvittava purkaja on varattu.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Pysäytä muut toiminnot, jotka purkavat mediaa, ja yritä uudelleen.";
